//package ban.inspector;
//
//import com.fasterxml.jackson.core.JsonProcessingException;
//import com.fasterxml.jackson.core.type.TypeReference;
//import com.fasterxml.jackson.databind.ObjectMapper;
//import org.junit.jupiter.api.Test;
//
//import java.io.*;
//import java.util.List;
//
//public class TestData {
//
//    @Test
//    void test() throws JsonProcessingException {
//        List<String> data = List.of("졸라", "시팔", "늬미", "bitch", "dildo", "dork", "fetish", "fuck", "fucker", "Fucking", "fuckyou", "hentai", "motherfucker", "oral", "orgasms", "penis", "pennis", "pervert", "petish", "phonesex", "porn", "porner", "porno", "sex", "suck", "sucks", "가슴빨아", "가슴빨어", "가슴조물락", "가슴주물럭", "가슴쪼물딱", "가슴쪼물락", "가슴핧아", "가슴핧어", "갈보", "강간", "개걸레", "개놈", "개년", "개등신", "개병신", "개보쥐", "개보지", "개부랄", "개시키", "개새끼", "개십", "개십새", "개십세", "개쓰레기", "개씨발", "개씨펄", "개자식", "개자지", "개잡년", "개잡지랄", "개젓가튼넘", "개좃", "개좆", "개죷", "개지랄", "걔잡년", "걔잡지랄", "굿보지", "근친상간", "깔다구", "깔따구", "깝친다", "꼴리다", "난교", "남창", "내꺼빨아", "내꺼핧아", "내미랄", "내버지", "내씨발", "내자지", "내잠지", "내조지", "너거애비", "너거어마이", "너그어미", "뇬", "뉘귀미", "뉘긔미", "뉘기뮈", "뉘기미", "뉘김", "뉘뮈", "뉘미", "뉘미랄", "뉘미럴", "뉘미룰", "뉘이미", "뉭기리", "뉭기미", "느그애미", "느그애비", "느그엄마", "느그에미", "느그에비", "늬귀미", "늬긔믜", "늬긔미", "늬기뮈", "늬기미", "늬믜", "늬미", "닁기미", "닁김", "니귀뮈", "니귀미", "니그으미", "니긔미", "니기뮈", "니기믜", "니기미", "니김이", "니매랄", "니매럴", "니머럴", "니뭬랄", "니뭬럴", "니뮈", "니밀할", "니아범", "니애미", "니애비", "니어미", "니엄마", "니에미", "니에비", "니이미", "니조개", "니조게", "니좃", "니할애비", "님이럴", "닝기리", "닝기미", "다무러라", "닥대가리", "닥대갈", "닥대구빡", "닥처", "닥쳐", "닥쵸", "닥춰", "닥치", "닦처", "닦쳐", "닦초", "닦쵸", "닦춰", "닦치", "닭대가리", "닭대갈", "닭데갈", "닭뒈가리", "닭쳐", "대가뤼", "대가리", "대갈", "대져", "대주까", "대줄께", "대줄년", "대질래", "대질레", "댁빠리", "덜은새끼", "덩쉰", "덩신", "데가뤼", "데가리", "데갈텅", "데갈통", "돌대가리", "돌림빵", "돌마니", "돌머리", "돌아이", "돌은년", "돌은넘", "뒈가리", "뒈져", "뒈져라", "뒈진다", "뒈질", "뒈질래", "뒈질레", "뒤싸질놈", "뒤여질놈", "뒤저라", "뒤져", "뒤진", "뒤질", "뒤짐", "드러운놈", "드러운뇬", "드러운새끼", "등쉰", "등시", "등신", "등신새끼", "등신세끼", "디져", "디져라", "디진다", "디질래", "디질레", "따먹기", "따먹어", "따묵기", "딸치냐", "떠라이", "떡치기", "떨거지", "떨아이", "또라이", "똘아이", "띠부랄", "띠불", "룸섹스", "막대쑤셔줘", "맛간년", "맛없는년", "맛이간년", "맞아죽을놈", "매춘", "매친뇬", "머저리", "멍청한년", "몸파는", "몸파라", "미친놈", "미친년", "미친뇬", "백보지", "뱅신", "버러지", "버짓물", "변녀", "변섹", "변태", "병딱", "병쉰", "병싀", "병싄아", "병신", "보뒤", "보오지", "보쥐", "보쥐털", "봉알", "뵹신", "부랄", "부럴", "불알", "붕신", "붕알", "뷔웅신", "븅따", "븅딱", "븅새끼", "븅쉰", "븅시나", "븅신", "븡딱", "븡신", "븡알", "븨융신", "빙쉰", "빙신", "빙신아", "빠구뤼", "빠구리", "빠꾸뤼", "빠큐", "빡순이", "빡촌", "빡큐", "빡통", "빨자좃", "빽보지", "뻐뀨", "뻐큐", "뻐킹", "뻑뀨", "뻑유", "뻑큐", "뽀르노", "뽀쥐털", "뽀즤", "뽀지", "뽀큐", "뽕알", "뿡알", "쁑신", "삐꾸", "삥신", "사까시", "사창가", "사카시", "사카씨", "삿깟시", "상년", "새꺄", "새끼", "새대갈", "새대구빡", "새데가리", "새데갈", "새데구빡", "새킈", "새키", "색걸", "색골", "색귀", "색긔", "색기", "색뀌", "색끼", "색녀", "색마", "색스", "색쑤", "색쓰", "샹년", "샹뇬", "성경험", "성관계", "성교", "성욕구", "성체위", "섹걸", "섹골", "섹귀", "섹기", "섹끼", "섹남", "섹녀", "섹마", "섹보지", "섹소리", "섹슈", "섹스", "섹쑤", "섹쓰", "섹하자", "섹하장", "쇠대갈", "수간", "수음", "시바", "시발", "시부랄", "신음소리", "십지랄", "십질", "십창", "싯팔", "쌍넘", "쌍년", "쌍놈", "쌍뇬", "쌕스", "쌕쑤", "쌕쓰", "쎅수", "쎅스", "씨댕이", "씨뎅", "씨바", "씨발", "씨밟", "씨방새", "씨방세", "씨빨", "씨팔", "씨팝", "씹년", "씹물", "씹창", "씹탱", "씹텡", "씻발", "아가리", "아갈", "아씨발", "애액", "앰병", "앰창", "야겜", "얨병", "얼간이", "엠창", "염병", "엿가튼", "엿같은", "엿같이", "엿놈", "엿머거", "엿먹어", "엿먹으셈", "옘병", "오랄", "오럴", "오르가즘", "왕자지", "왕잠지", "육봉", "육시럴", "육실할", "육실헐", "육씨랄년", "육씨랄놈", "윤간", "음욕", "젖까", "젖꼭쥐", "젖꼭지", "조가튼", "조건만남", "조까", "조빱", "조온나", "존나", "존만한", "존만히", "좀물", "좁물", "좁밥", "좃가튼", "좃간년", "좃같네", "좃같은", "좃까", "좃깟네", "좃깨", "좃께", "좃나", "좃냄새", "좃넘", "좃대로", "좃만아", "좃만이", "좃만한", "좃먹어", "좃물", "좃밥", "좃빠네", "좃빠라", "좃빱", "좃빺", "좃잡고", "좃털", "종간나", "죠또", "죠랄하네", "주글년", "주글래", "주길년", "주둥아리", "죽고싶냐", "죽구십냐", "죽구싶냐", "죽을년", "죽을놈", "죽을래", "죽이삔다", "죽일년", "죽일놈", "쥐랄", "쥐럴", "쥐뢀", "쥐룰", "즤랄", "지랄", "지럴", "지롤", "지뢀", "지이랄", "지이럴", "짜지털", "짬지", "쪼갈", "쪼개지마", "찢어죽일년", "찢어죽일놈", "창녀", "창년", "창놈", "창뇨", "창뇬", "쳐죽인다", "쳐죽일것", "쳐죽일년", "쳐죽일놈", "콘돔", "큰보지", "클리토리스", "패티쉬", "패티시", "팰라치오", "퍼큐", "퍽유", "퍽큐", "페티걸", "펠라치오", "포로느", "포르노", "포온섹", "폰색", "폰섹", "폰쎅", "헐렁보지", "후좡", "윤락", "거시기", "발기", "보랄", "보럴", "뽀쥐", "색남", "색수", "음부", "애널", "애무", "에미", "음경", "개불알", "개붕알", "개쉬바", "개쉬발", "개쉬벌", "개시끼", "개시바", "개시발", "개쌍넘", "개쌍년", "개쌍놈", "개쌍뇬", "개쌔", "개쌕기", "개썌끼", "개쎄끼야", "개쒜리", "개쓉", "개쓰래기", "개씨바", "개씨블", "개씨뻘", "개씹", "개씹세", "개자쉭", "개자슥", "개자씩", "개자쥐", "걸래가튼뇬", "걸래같은년", "걸래년", "게가튼", "게같은", "게새끼", "게시끼", "게쎄기", "게쎄끼", "게자쉭", "게자슥", "게자식", "게자쥐", "게자지", "게좆", "게지뢀", "계색갸", "계세키", "뉘미쉬벌", "늬음마", "니미좃", "니보지", "니보지구멍", "미친", "미친새끼", "미췬", "미췬세끼", "병쉬", "병어신", "보지", "보지뇬", "보짓년", "보짓물", "보짖물", "부카케", "붕뛴", "붕싄", "뷩쉬", "뷩싄", "뻨유", "뻨큐", "쉬부랄", "씨베렐", "씨봉알", "씨부랠", "씨부럴잡놈", "씨부럴개잡놈", "씹구멍", "씹젖", "씹좆", "씹좇", "자지", "조까치", "조까튼", "조깓", "조깟", "조깠", "조깥", "조옷가튼", "조옷같", "조카툰", "족가튼", "족같은", "족까치", "좃갔다", "좃같", "좃같내", "로리타", "로리", "아동포르노", "미성년자포르노", "아동매춘", "아동매춘물", "아동음란물", "아동물", "망가", "여고생교복야동", "여고생교복", "여고생야동", "교복야동", "로리콤", "로리콘", "보슬아치", "개쓰레기잡놈", "씨발색기", "씨발놈", "씨발놈의새끼", "샹늠", "샹놈의새끼", "미친씨발", "미친씨발놈", "낙태충", "blowjob");
//        System.out.println("Checking for Updates");
//        System.out.println("Latest Version");
//        List<String> newData = data.stream().distinct().sorted().toList();
//        ObjectMapper mapper = new ObjectMapper();
//        String newWord = mapper.writeValueAsString(newData);
//        System.out.println(newWord);
//    }
//
//    @Test
//    void test2() throws IOException {
//
//        ObjectMapper mapper = new ObjectMapper();
//        List<String> data = mapper.readValue(new File("src/main/resources/static/BanWords.json"), new TypeReference<>() {});
//        System.out.println("data = " + data);
//    }
//
//    @Test
//    void test3() {
//
//    }
//
//    public record TestUpdateInfo(String version, List<String> words) {
//
//    }
//}
